posts/na-xie-ti-gao-xiao-lu-de-ideacha-jian/index.org
#+BEGIN_COMMENT
.. title: 那些提高效率的Idea插件
.. slug: na-xie-ti-gao-xiao-lu-de-ideacha-jian
.. date: 2018-09-05 08:12:23 UTC+08:00
.. tags: idea, plugin
.. category: tool
.. link: 
.. description: 总结归纳我使用的高效的idea插件
.. type: text
#+END_COMMENT

* .ignore
  :PROPERTIES:
  :ID:       AE24E7B5-476E-4121-BF03-B56F91C3D334
  :END:
** 插件说明
   :PROPERTIES:
   :ID:       FA818BA8-4658-4945-BC78-CB5FE9158CD5
   :END:
  ignore文件忽略，支持绝大多数的开发语言，支持直接导航到忽略的文件，在创建时可以选择模板，比如Java开发可以选择Java与Idea选项来生成忽略target文件与.idea文件等的忽略规则。
** 项目地址
   :PROPERTIES:
   :ID:       EB4B8E7E-6E5B-4606-BCA2-1DE9C76B7DFE
   :END:
   [[https://github.com/hsz/idea-gitignore]]
* IdeaVim
  :PROPERTIES:
  :ID:       CE57BFC9-7C86-4F59-AB90-2269F6420F6F
  :END:
** 插件说明
   :PROPERTIES:
   :ID:       8E43E640-B183-4816-8F73-6C57957409CE
   :END:
   在Idea中使用vi键位来进行编码操作,可以很高的提高效率,插件支持自定义键位来对Idea的action来进行定制,程序员可以根据自己的编程习惯来定制出一个键盘流来.
** 项目地址
   :PROPERTIES:
   :ID:       0A6CB64D-16EF-4251-BF41-592D3E1FE2DB
   :END:
   [[https://github.com/JetBrains/ideavim]]
* emacsIDEAs
  :PROPERTIES:
  :ID:       8B7FB695-0353-4B60-BAD5-A2B925431EA9
  :END:
** 插件说明
   :PROPERTIES:
   :ID:       997170C1-0DA9-4F3C-A9D1-B12FB18D206D
   :END:
   支持一些Emacs操作的Idea插件,主要是一些复制,移动,替换,跳转的快捷操作,目前使用最多的是快速查找替换.
** 项目地址
   :PROPERTIES:
   :ID:       AA572D98-2A6F-47B3-88D2-B18E07DB7462
   :END:
   [[https://github.com/whunmr/emacsIDEAs]]
{{{TEASER_END}}}
* Custom Postfix Templates
  :PROPERTIES:
  :ID:       B969793C-24F1-4262-A1FB-854D3CDB255C
  :END:
** 插件说明
   :PROPERTIES:
   :ID:       0963FC40-203D-4F55-8365-83BB943735DE
   :END:
   Idea中非常高效的就是postfix，但是系统自带不可以进行增加，这个插件就可以让用户可以自定义一些高级的postfix语句来提高效率。
** 项目地址
   :PROPERTIES:
   :ID:       09C4479D-0AF0-41AA-B8F5-2EA0F264F9E9
   :END:
   [[https://github.com/xylo/intellij-postfix-templates]]
* Jrebel
  :PROPERTIES:
  :ID:       3A990891-E12B-4B6A-A685-474A3896CACB
  :END:
** 插件说明
   :PROPERTIES:
   :ID:       3D07DD35-361D-47E7-BA2B-EFB07420B37B
   :END:
   动态部署代码插件,可以在不重启Tomcat的情况下进行代码的热部署，提高开发效率没得说。先前可以使用twitter号来免费使用，现在不行，需要自行购买了。
** 项目地址
   :PROPERTIES:
   :ID:       99E30349-2E94-48FF-BA2C-25CD5BABCDDA
   :END:
   [[https://zeroturnaround.com/software/jrebel/]]
* CamelCase
  :PROPERTIES:
  :ID:       420C1FCA-6B61-4340-B61B-DD8DC6191B3A
  :END:
** 插件说明
   :PROPERTIES:
   :ID:       92D90573-F916-40CB-BE11-488048017BFA
   :END:
   文本驼峰规则快速转换，支持从CamelCase->camelCaase->camel_case->camel-case->CAMEL_CASE的顺序转换，idea中只支持全部大写与全部小写的转换.
** 项目地址
   :PROPERTIES:
   :ID:       07FFBC99-11D2-48B3-872E-26192C98E0D8
   :END:
   [[https://plugins.jetbrains.com/plugin/7160-camelcase]]
* codehelper
  :PROPERTIES:
  :ID:       E41C2EB4-6736-474C-9D8E-B37CD3C91F38
  :END:
** 插件说明
   :PROPERTIES:
   :ID:       B31581DF-8D48-4DC7-A265-24184A4FB35F
   :END:
   - 代码自动生成插件，支持根据Pojo名来生成dao,mapper,xml等文件，目前使用较少
   - 生成实体类的setter方法，使用频率高，主要是生成类的setter方法，配合F2查找下一个错误而使焦点至上而下，操作起来非常顺畅。
** 项目地址
   :PROPERTIES:
   :ID:       7B17DC11-1D52-42B1-8F37-72AB73457680
   :END:
   [[https://github.com/zhengjunbase/codehelper.generator]]
* Translation
  :PROPERTIES:
  :ID:       A2253F22-B0FB-40A5-A9F4-CFF277190BBB
  :END:
** 插件说明
   :PROPERTIES:
   :ID:       F03E03F4-6172-4E1D-976D-F0C5B570D5F9
   :END:
   Idea中集成翻译功能,目前支持有道和goolge,百度翻译.
** 项目地址
   :PROPERTIES:
   :ID:       4773A673-602D-4C6B-BA15-9B5E9A3B0E61
   :END:
   [[https://github.com/izhangzhihao/intellij-rainbow-brackets]]
* Clock
  :PROPERTIES:
  :ID:       F4C27BD0-DF84-49ED-8F3D-94ECC6979167
  :END:
** 插件说明
   :PROPERTIES:
   :ID:       B088CD6F-394A-483B-8159-C8503406E536
   :END:
   当你全屏投入工作时，想知道当前的时间，需要切换出全屏模式，这样就打乱了节奏，这个插件可以在Idea的右下方显示出当前的时间信息，非常实用。
** 插件地址
   :PROPERTIES:
   :ID:       0DA7621F-D518-4BD7-BEDB-B9F54D11912E
   :END:
   [[https://github.com/amolenaar/idea-clock]]
* Dash
  :PROPERTIES:
  :ID:       53A2EC4A-0D57-482E-96A9-CD1FD0EC9BCE
  :END:
