posts/na-xie-ti-gao-xiao-lu-de-ideacha-jian/index.html
<!DOCTYPE html>
<html prefix="        og: http://ogp.me/ns# article: http://ogp.me/ns/article#     " vocab="http://ogp.me/ns" lang="zh_cn">
<head>
<meta charset="utf-8">
<meta name="description" content="总结归纳我使用的高效的idea插件">
<meta name="viewport" content="width=device-width">
<title>那些提高效率的Idea插件 | I'm company</title>
<link href="https://fonts.googleapis.com/css?family=Bitter:400,400i,700" rel="stylesheet" type="text/css">
<link rel="stylesheet" href="https://use.fontawesome.com/releases/v5.0.13/css/all.css" integrity="sha384-DNOHZ68U8hZfKXOrtjWvjxusGo9WQnrNx2sqG0tfsghAvtVlRW3tvkXWZh58N9jp" crossorigin="anonymous">
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" hreflang="zh_cn" href="../../rss.xml">
<link rel="canonical" href="http://blog.imcompany.cn/posts/na-xie-ti-gao-xiao-lu-de-ideacha-jian/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Tomyli">
<link rel="prev" href="../she-ji-mo-shi-xue-xi-zhi-dai-li-mo-shi/" title="设计模式学习之代理模式" type="text/html">
<link rel="next" href="../na-xie-ti-gao-xiao-lu-de-alfred-workflow/" title="那些提高效率的Alfred Workflow" type="text/html">
<meta property="og:site_name" content="I'm company">
<meta property="og:title" content="那些提高效率的Idea插件">
<meta property="og:url" content="http://blog.imcompany.cn/posts/na-xie-ti-gao-xiao-lu-de-ideacha-jian/">
<meta property="og:description" content="总结归纳我使用的高效的idea插件">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2018-09-05T08:12:23+08:00">
<meta property="article:tag" content="idea">
<meta property="article:tag" content="plugin">
</head>
<body>
    <a href="#page-content" class="sr-only sr-only-focusable">跳到主内容</a>
    <section class="social"><ul>
<li><a href="../../index.html" title="Home"><i class="fa fa-home"></i></a></li>
            <li><a href="../../archive.html" title="Archives"><i class="fa fa-folder-open"></i></a></li>
            <li><a href="../../categories/index.html" title="Tags"><i class="fa fa-tags"></i></a></li>
            <li><a href="../../rss.xml" title="RSS"><i class="fa fa-rss"></i></a></li>
            <li><a href="https://getnikola.com" title="About me"><i class="fa fa-user"></i></a></li>
            <li><a href="https://twitter.com/hougemeiga" title="My Twitter"><i class="fab fa-twitter"></i></a></li>
            <li><a href="https://github.com/peng051410" title="My Github"><i class="fab fa-github"></i></a></li>
    
    

        </ul></section><section class="page-content"><div class="content" rel="main">
            
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">那些提高效率的Idea插件</a></h1>

        <div class="metadata">
            <p class="dateline"><a href="." rel="bookmark"><i class="fa fa-clock"></i> <time class="published dt-published" datetime="2018-09-05T08:12:23+08:00" itemprop="datePublished" title="2018-09-05 08:12">2018-09-05 08:12</time></a></p>
            <p class="byline author vcard"> <i class="fa fa-user"></i> <span class="byline-name fn" itemprop="author">
                    Tomyli
            </span></p>
                <p class="commentline"><i class="far fa-comment"></i>
        
    <a href="#disqus_thread" data-disqus-identifier="cache/posts/na-xie-ti-gao-xiao-lu-de-ideacha-jian.html">Comments</a>


            
        </p>
<p class="sourceline"><a href="index.org" class="sourcelink"><i class="fa fa-file-code"></i> 资源</a></p>

            

            
    <div class="tags">
<h3 class="metadata-title">
<i class="fa fa-tags"></i> 标签:</h3>
        <ul itemprop="keywords" class="tags-ul">
<li><a class="tag p-category" href="../../categories/idea/" rel="tag">idea</a></li>
            <li><a class="tag p-category" href="../../categories/plugin/" rel="tag">plugin</a></li>
        </ul>
</div>

        </div>
    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-org37057d2" class="outline-2">
<h2 id="org37057d2">
<a id="ID-AE24E7B5-476E-4121-BF03-B56F91C3D334"></a>.ignore</h2>
<div class="outline-text-2" id="text-org37057d2">
</div>
<div id="outline-container-org367a015" class="outline-3">
<h3 id="org367a015">
<a id="ID-FA818BA8-4658-4945-BC78-CB5FE9158CD5"></a>插件说明</h3>
<div class="outline-text-3" id="text-org367a015">
<p>
ignore文件忽略，支持绝大多数的开发语言，支持直接导航到忽略的文件，在创建时可以选择模板，比如Java开发可以选择Java与Idea选项来生成忽略target文件与.idea文件等的忽略规则。
</p>
</div>
</div>
<div id="outline-container-org4098594" class="outline-3">
<h3 id="org4098594">
<a id="ID-EB4B8E7E-6E5B-4606-BCA2-1DE9C76B7DFE"></a>项目地址</h3>
<div class="outline-text-3" id="text-org4098594">
<p>
<a href="https://github.com/hsz/idea-gitignore">https://github.com/hsz/idea-gitignore</a>
</p>
</div>
</div>
</div>
<div id="outline-container-orge863cc2" class="outline-2">
<h2 id="orge863cc2">
<a id="ID-CE57BFC9-7C86-4F59-AB90-2269F6420F6F"></a>IdeaVim</h2>
<div class="outline-text-2" id="text-orge863cc2">
</div>
<div id="outline-container-orgbd41caf" class="outline-3">
<h3 id="orgbd41caf">
<a id="ID-8E43E640-B183-4816-8F73-6C57957409CE"></a>插件说明</h3>
<div class="outline-text-3" id="text-orgbd41caf">
<p>
在Idea中使用vi键位来进行编码操作,可以很高的提高效率,插件支持自定义键位来对Idea的action来进行定制,程序员可以根据自己的编程习惯来定制出一个键盘流来.
</p>
</div>
</div>
<div id="outline-container-org8060484" class="outline-3">
<h3 id="org8060484">
<a id="ID-0A6CB64D-16EF-4251-BF41-592D3E1FE2DB"></a>项目地址</h3>
<div class="outline-text-3" id="text-org8060484">
<p>
<a href="https://github.com/JetBrains/ideavim">https://github.com/JetBrains/ideavim</a>
</p>
</div>
</div>
</div>
<div id="outline-container-org3330d8a" class="outline-2">
<h2 id="org3330d8a">
<a id="ID-8B7FB695-0353-4B60-BAD5-A2B925431EA9"></a>emacsIDEAs</h2>
<div class="outline-text-2" id="text-org3330d8a">
</div>
<div id="outline-container-org16a9bff" class="outline-3">
<h3 id="org16a9bff">
<a id="ID-997170C1-0DA9-4F3C-A9D1-B12FB18D206D"></a>插件说明</h3>
<div class="outline-text-3" id="text-org16a9bff">
<p>
支持一些Emacs操作的Idea插件,主要是一些复制,移动,替换,跳转的快捷操作,目前使用最多的是快速查找替换.
</p>
</div>
</div>
<div id="outline-container-org71336d5" class="outline-3">
<h3 id="org71336d5">
<a id="ID-AA572D98-2A6F-47B3-88D2-B18E07DB7462"></a>项目地址</h3>
<div class="outline-text-3" id="text-org71336d5">
<p>
<a href="https://github.com/whunmr/emacsIDEAs">https://github.com/whunmr/emacsIDEAs</a>
</p>
</div>
</div>
</div>
<div id="outline-container-org37be23e" class="outline-2">
<h2 id="org37be23e">
<a id="ID-B969793C-24F1-4262-A1FB-854D3CDB255C"></a>Custom Postfix Templates</h2>
<div class="outline-text-2" id="text-org37be23e">
</div>
<div id="outline-container-orgcecece8" class="outline-3">
<h3 id="orgcecece8">
<a id="ID-0963FC40-203D-4F55-8365-83BB943735DE"></a>插件说明</h3>
<div class="outline-text-3" id="text-orgcecece8">
<p>
Idea中非常高效的就是postfix，但是系统自带不可以进行增加，这个插件就可以让用户可以自定义一些高级的postfix语句来提高效率。
</p>
</div>
</div>
<div id="outline-container-org0540f71" class="outline-3">
<h3 id="org0540f71">
<a id="ID-09C4479D-0AF0-41AA-B8F5-2EA0F264F9E9"></a>项目地址</h3>
<div class="outline-text-3" id="text-org0540f71">
<p>
<a href="https://github.com/xylo/intellij-postfix-templates">https://github.com/xylo/intellij-postfix-templates</a>
</p>
</div>
</div>
</div>
<div id="outline-container-orgbecd7b9" class="outline-2">
<h2 id="orgbecd7b9">
<a id="ID-3A990891-E12B-4B6A-A685-474A3896CACB"></a>Jrebel</h2>
<div class="outline-text-2" id="text-orgbecd7b9">
</div>
<div id="outline-container-org5416e09" class="outline-3">
<h3 id="org5416e09">
<a id="ID-3D07DD35-361D-47E7-BA2B-EFB07420B37B"></a>插件说明</h3>
<div class="outline-text-3" id="text-org5416e09">
<p>
动态部署代码插件,可以在不重启Tomcat的情况下进行代码的热部署，提高开发效率没得说。先前可以使用twitter号来免费使用，现在不行，需要自行购买了。
</p>
</div>
</div>
<div id="outline-container-org1c364ce" class="outline-3">
<h3 id="org1c364ce">
<a id="ID-99E30349-2E94-48FF-BA2C-25CD5BABCDDA"></a>项目地址</h3>
<div class="outline-text-3" id="text-org1c364ce">
<p>
<a href="https://zeroturnaround.com/software/jrebel/">https://zeroturnaround.com/software/jrebel/</a>
</p>
</div>
</div>
</div>
<div id="outline-container-orgb1c6efb" class="outline-2">
<h2 id="orgb1c6efb">
<a id="ID-420C1FCA-6B61-4340-B61B-DD8DC6191B3A"></a>CamelCase</h2>
<div class="outline-text-2" id="text-orgb1c6efb">
</div>
<div id="outline-container-org7840d2f" class="outline-3">
<h3 id="org7840d2f">
<a id="ID-92D90573-F916-40CB-BE11-488048017BFA"></a>插件说明</h3>
<div class="outline-text-3" id="text-org7840d2f">
<p>
文本驼峰规则快速转换，支持从CamelCase-&gt;camelCaase-&gt;camel<sub>case</sub>-&gt;camel-case-&gt;CAMEL<sub>CASE的顺序转换</sub>，idea中只支持全部大写与全部小写的转换.
</p>
</div>
</div>
<div id="outline-container-org95e3afd" class="outline-3">
<h3 id="org95e3afd">
<a id="ID-07FFBC99-11D2-48B3-872E-26192C98E0D8"></a>项目地址</h3>
<div class="outline-text-3" id="text-org95e3afd">
<p>
<a href="https://plugins.jetbrains.com/plugin/7160-camelcase">https://plugins.jetbrains.com/plugin/7160-camelcase</a>
</p>
</div>
</div>
</div>
<div id="outline-container-org2d0ce47" class="outline-2">
<h2 id="org2d0ce47">
<a id="ID-E41C2EB4-6736-474C-9D8E-B37CD3C91F38"></a>codehelper</h2>
<div class="outline-text-2" id="text-org2d0ce47">
</div>
<div id="outline-container-org1b33104" class="outline-3">
<h3 id="org1b33104">
<a id="ID-B31581DF-8D48-4DC7-A265-24184A4FB35F"></a>插件说明</h3>
<div class="outline-text-3" id="text-org1b33104">
<ul class="org-ul">
<li>代码自动生成插件，支持根据Pojo名来生成dao,mapper,xml等文件，目前使用较少</li>
<li>生成实体类的setter方法，使用频率高，主要是生成类的setter方法，配合F2查找下一个错误而使焦点至上而下，操作起来非常顺畅。</li>
</ul>
</div>
</div>
<div id="outline-container-org7c52953" class="outline-3">
<h3 id="org7c52953">
<a id="ID-7B17DC11-1D52-42B1-8F37-72AB73457680"></a>项目地址</h3>
<div class="outline-text-3" id="text-org7c52953">
<p>
<a href="https://github.com/zhengjunbase/codehelper.generator">https://github.com/zhengjunbase/codehelper.generator</a>
</p>
</div>
</div>
</div>
<div id="outline-container-org946a099" class="outline-2">
<h2 id="org946a099">
<a id="ID-A2253F22-B0FB-40A5-A9F4-CFF277190BBB"></a>Translation</h2>
<div class="outline-text-2" id="text-org946a099">
</div>
<div id="outline-container-orgb3ce9fd" class="outline-3">
<h3 id="orgb3ce9fd">
<a id="ID-F03E03F4-6172-4E1D-976D-F0C5B570D5F9"></a>插件说明</h3>
<div class="outline-text-3" id="text-orgb3ce9fd">
<p>
Idea中集成翻译功能,目前支持有道和goolge,百度翻译.
</p>
</div>
</div>
<div id="outline-container-org518864d" class="outline-3">
<h3 id="org518864d">
<a id="ID-4773A673-602D-4C6B-BA15-9B5E9A3B0E61"></a>项目地址</h3>
<div class="outline-text-3" id="text-org518864d">
<p>
<a href="https://github.com/izhangzhihao/intellij-rainbow-brackets">https://github.com/izhangzhihao/intellij-rainbow-brackets</a>
</p>
</div>
</div>
</div>
<div id="outline-container-org6559ce7" class="outline-2">
<h2 id="org6559ce7">
<a id="ID-F4C27BD0-DF84-49ED-8F3D-94ECC6979167"></a>Clock</h2>
<div class="outline-text-2" id="text-org6559ce7">
</div>
<div id="outline-container-org59ec9db" class="outline-3">
<h3 id="org59ec9db">
<a id="ID-B088CD6F-394A-483B-8159-C8503406E536"></a>插件说明</h3>
<div class="outline-text-3" id="text-org59ec9db">
<p>
当你全屏投入工作时，想知道当前的时间，需要切换出全屏模式，这样就打乱了节奏，这个插件可以在Idea的右下方显示出当前的时间信息，非常实用。
</p>
</div>
</div>
<div id="outline-container-org9a144eb" class="outline-3">
<h3 id="org9a144eb">
<a id="ID-0DA7621F-D518-4BD7-BEDB-B9F54D11912E"></a>插件地址</h3>
<div class="outline-text-3" id="text-org9a144eb">
<p>
<a href="https://github.com/amolenaar/idea-clock">https://github.com/amolenaar/idea-clock</a>
</p>
</div>
</div>
</div>
