posts/na-xie-ti-gao-xiao-lu-de-ideacha-jian/index.org
** 插件说明
   :PROPERTIES:
   :ID:       F215A191-DF19-406C-9A27-73D0D295F28B
   :END:
   Dash是一个mac上的开发文档查询工具,Idea Dash这个插件使得开发者可以直接通过快捷键来调用Dash工具进行文档的查询.目前这个插件提供了对Dash,Velocity,Zeald三种工具的支持.
** 项目地址
   :PROPERTIES:
   :ID:       AE664191-A8B1-47CB-B1C9-CF7BF034DDA2
   :END:
   [[https://github.com/gdelmas/IntelliJDashPlugin]]
* Rainbow Brackets
  :PROPERTIES:
  :ID:       40EEAE95-B5BB-4515-81DE-47D07B1BA622
  :END:
** 插件说明
   :PROPERTIES:
   :ID:       7703CC72-0D60-4F12-9A8A-178BA3FB0602
   :END:
   让Idea的括号更好看，对于对应的括号(标签)会显示相同的颜色，特别对于编写html时的标签对应，一眼就可以看出来标签是不是对应出现的。
** 项目地址
   :PROPERTIES:
   :ID:       766072E8-6980-4E0A-BBE0-DE08F42598E9
   :END:
   [[https://github.com/izhangzhihao/intellij-rainbow-brackets]]
* RestfulToolkit
  :PROPERTIES:
  :ID:       BDB0AC3F-0791-48E6-BA37-179AAE9AEC0F
  :END:
** 插件说明
   :PROPERTIES:
   :ID:       9911BAA8-A380-4FC1-9283-4405940475E8
   :END:
   此项目可以快速查询Springmvc项目中Controller的Mapping定义，即根据url来跳转方法定义，在原有Idea的按类、按文件、按方法名查找功能上增添新的查找功能。非常好用。
** 项目地址
   :PROPERTIES:
   :ID:       ED1A889A-378D-40D7-AA74-A0A346869560
   :END:
   [[https://plugins.jetbrains.com/plugin/10292-restfultoolkit]] 
* Duplicate Lines
  :PROPERTIES:
  :ID:       216DEF52-C09E-4EEA-8AD1-FA947CD190CC
  :END:
** 插件说明
   :PROPERTIES:
   :ID:       2B79D77B-D3E8-4593-9C98-2D6BAD9A9054
   :END:
   这是一个快速复制行内容的插件,Idea默认也是支持复制行的操作,当你选中了括号中的文字时再想进行复制编辑时这个插件就可以发挥作用了,它会复制行的内容,并将光标置于被复制行时选中的字符上,这样就可以接着进行复制后的修改操作了.
** 项目地址
   :PROPERTIES:
   :ID:       6476EC26-645B-4080-97B1-4F102671F10C
   :END:
   [[https://github.com/xusoo/duplicate-lines-intellij-plugin]]
* FindBugs
  :PROPERTIES:
  :ID:       222E0010-CC4E-4D8B-A645-190AB5F06678
  :END:
** 插件说明
   :PROPERTIES:
   :ID:       E5C1765E-A2C7-423F-A57C-A8C4DDDEB5BA
   :END:
   静态代码bug查找工具,帮程序员在编写时发现一些错误的代码问题,支持200多个分析规则.
** 项目地址
   :PROPERTIES:
   :ID:       F9E78623-439D-4951-B113-AA49CB5E4DAF
   :END:
   [[http://andrepdo.github.io/findbugs-idea/]]
* JSON Viewer
  :PROPERTIES:
  :ID:       71C062FA-7106-4556-AD1B-7A5E2727F556
  :END:
** 插件说明
   :PROPERTIES:
   :ID:       705D4294-9625-484A-8973-385A9059C3C1
   :END:
   在Idea中进行json的格式化与查看工具.
** 项目地址
   :PROPERTIES:
   :ID:       56A64E85-92BA-4D7A-831A-61FF7A609B91
   :END:
   [[https://github.com/potterhsu/JsonViewer]]
* Json2Java4Idea
  :PROPERTIES:
  :ID:       4862DD4F-1F8A-494E-B4EB-464097979D07
  :END:
** 插件说明
   :PROPERTIES:
   :ID:       39E40656-B768-40F4-B012-A9E54030DA42
   :END:
   根据Json数据来生成Java类的工具,支持Jackson,Json,Moshi.
** 项目地址
   :PROPERTIES:
   :ID:       E62B7480-B68F-49C2-8597-CBA460BA6D6B
   :END:
   [[https://github.com/t28hub/json2java4idea]]
* LivePlugin
  :PROPERTIES:
  :ID:       93A20935-D6FD-4B80-A530-AB6F64241252
  :END:
** 插件说明
   :PROPERTIES:
   :ID:       06CAFD2F-F281-45E5-952F-DB4F013F5882
   :END:
   在不重启Idea情况下来编写Idea插件,可以编写一些小的功能插件.
** 项目地址
   :PROPERTIES:
   :ID:       EFC0B80A-9CA6-42CB-89FA-8C225C73D47A
   :END:
   [[https://github.com/dkandalov/live-plugin]]
* Lombok
  :PROPERTIES:
  :ID:       9BC31DA0-8713-4A02-9CD0-1C76D3925086
  :END:
** 插件说明
   :PROPERTIES:
   :ID:       44234C4B-1DED-429C-97FD-CFADBE345AA7
   :END:
   [[https://projectlombok.org/][Lombox]]的Idea插件,使用注释的方式来快速处理getter和setter,当然功能不止这些.
** 项目地址
   :PROPERTIES:
   :ID:       F8250121-75E2-4026-8C70-F86ADC7B532F
   :END:
   [[https://github.com/mplushnikov/lombok-intellij-plugin]]
* Missing In Actions
  :PROPERTIES:
  :ID:       44A4CF65-6EBD-40EA-839D-11688AA86B6A
  :END:
  [[https://github.com/vsch/MissingInActions][Missing In Actions]]，增强的action，带来了Idea Action缺少的增强动作，如移动语句自动缩进、剪切历史增强中等功能。
* PlantUML
  :PROPERTIES:
  :ID:       3D44E02D-75D3-4F35-A811-6A71C969558B
  :END:
** 插件说明
   :PROPERTIES:
   :ID:       6632D887-D803-4263-A657-A74903FB33AD
   :END:
   在Idea中进行uml图的处理.
** 项目地址
   :PROPERTIES:
   :ID:       0BACA036-041F-4283-98D2-D8D0958A91F0
   :END:
   [[https://github.com/esteinberg/plantuml4idea]]
* POJO to JSON
  :PROPERTIES:
  :ID:       770E6BFF-E664-4171-9687-59F3D64652D2
  :END:
** 插件说明
   :PROPERTIES:
   :ID:       9B1B84F1-BE93-44A7-8129-39B667B7B737
   :END:
   Java类型转成JSON,方便用postman或者curl的时候构造JSON body.
** 项目地址
   :PROPERTIES:
   :ID:       1DDC8D32-2723-45E2-9517-B23EA1B86FAD
   :END:
   [[https://plugins.jetbrains.com/plugin/9686-pojo-to-json]]
* Save Actions
  :PROPERTIES:
  :ID:       C32E200E-6351-4A17-A1C6-B542E6D50FC0
  :END:
** 插件说明
   :PROPERTIES:
   :ID:       39B4C512-ABC5-47B0-9BBE-25DBEB377F45
   :END:
   Idea的保存动作的执行插件,支持在保存后执行一些命令,比如重新导入包,格式化代码,重新整理代码等.
** 项目地址
   :PROPERTIES:
   :ID:       BBDCBF13-7A09-4010-8A61-BD0A9D016163
   :END:
   [[https://github.com/dubreuia/intellij-plugin-save-actions]]
* Spring Assistant
  :PROPERTIES:
  :ID:       53786D1D-D25F-4C49-8DC0-BC788CCF258C
  :END:
** 插件说明
   :PROPERTIES:
   :ID:       8E4565A9-0C70-4D2E-94DF-681BA976BBE5
   :END:
   Springboot配置文件编写助手,在编写些插件会给出一些提示,帮助开发者可以更快速的进行配置.
** 项目地址
   :PROPERTIES:
   :ID:       B2F1472D-DD59-4E87-B433-27E0A66C1B4C
   :END:
   [[https://github.com/1tontech/intellij-spring-assistant]]
