posts/na-xie-ti-gao-xiao-lu-de-ideacha-jian/index.html
<div id="outline-container-orgae4e3d3" class="outline-2">
<h2 id="orgae4e3d3">
<a id="ID-53A2EC4A-0D57-482E-96A9-CD1FD0EC9BCE"></a>Dash</h2>
<div class="outline-text-2" id="text-orgae4e3d3">
</div>
<div id="outline-container-org0a72420" class="outline-3">
<h3 id="org0a72420">
<a id="ID-F215A191-DF19-406C-9A27-73D0D295F28B"></a>插件说明</h3>
<div class="outline-text-3" id="text-org0a72420">
<p>
Dash是一个mac上的开发文档查询工具,Idea Dash这个插件使得开发者可以直接通过快捷键来调用Dash工具进行文档的查询.目前这个插件提供了对Dash,Velocity,Zeald三种工具的支持.
</p>
</div>
</div>
<div id="outline-container-org27bae14" class="outline-3">
<h3 id="org27bae14">
<a id="ID-AE664191-A8B1-47CB-B1C9-CF7BF034DDA2"></a>项目地址</h3>
<div class="outline-text-3" id="text-org27bae14">
<p>
<a href="https://github.com/gdelmas/IntelliJDashPlugin">https://github.com/gdelmas/IntelliJDashPlugin</a>
</p>
</div>
</div>
</div>
<div id="outline-container-org70c0fd9" class="outline-2">
<h2 id="org70c0fd9">
<a id="ID-40EEAE95-B5BB-4515-81DE-47D07B1BA622"></a>Rainbow Brackets</h2>
<div class="outline-text-2" id="text-org70c0fd9">
</div>
<div id="outline-container-org05324a2" class="outline-3">
<h3 id="org05324a2">
<a id="ID-7703CC72-0D60-4F12-9A8A-178BA3FB0602"></a>插件说明</h3>
<div class="outline-text-3" id="text-org05324a2">
<p>
让Idea的括号更好看，对于对应的括号(标签)会显示相同的颜色，特别对于编写html时的标签对应，一眼就可以看出来标签是不是对应出现的。
</p>
</div>
</div>
<div id="outline-container-org78e73f6" class="outline-3">
<h3 id="org78e73f6">
<a id="ID-766072E8-6980-4E0A-BBE0-DE08F42598E9"></a>项目地址</h3>
<div class="outline-text-3" id="text-org78e73f6">
<p>
<a href="https://github.com/izhangzhihao/intellij-rainbow-brackets">https://github.com/izhangzhihao/intellij-rainbow-brackets</a>
</p>
</div>
</div>
</div>
<div id="outline-container-org87eac10" class="outline-2">
<h2 id="org87eac10">
<a id="ID-BDB0AC3F-0791-48E6-BA37-179AAE9AEC0F"></a>RestfulTools</h2>
<div class="outline-text-2" id="text-org87eac10">
</div>
<div id="outline-container-org370f63a" class="outline-3">
<h3 id="org370f63a">
<a id="ID-9911BAA8-A380-4FC1-9283-4405940475E8"></a>插件说明</h3>
<div class="outline-text-3" id="text-org370f63a">
<p>
此项目可以快速查询Springmvc项目中Controller的Mapping定义，即根据url来跳转方法定义，在原有Idea的按类、按文件、按方法名查找功能上增添新的查找功能。非常好用。
</p>
</div>
</div>
<div id="outline-container-org450f3c1" class="outline-3">
<h3 id="org450f3c1">
<a id="ID-ED1A889A-378D-40D7-AA74-A0A346869560"></a>项目地址</h3>
<div class="outline-text-3" id="text-org450f3c1">
<p>
<a href="https://plugins.jetbrains.com/plugin/10292-restfultoolkit">https://plugins.jetbrains.com/plugin/10292-restfultoolkit</a> 
</p>
</div>
</div>
</div>
<div id="outline-container-org3420f9c" class="outline-2">
<h2 id="org3420f9c">
<a id="ID-216DEF52-C09E-4EEA-8AD1-FA947CD190CC"></a>Duplicate Lines</h2>
<div class="outline-text-2" id="text-org3420f9c">
</div>
<div id="outline-container-orgffe4947" class="outline-3">
<h3 id="orgffe4947">
<a id="ID-2B79D77B-D3E8-4593-9C98-2D6BAD9A9054"></a>插件说明</h3>
<div class="outline-text-3" id="text-orgffe4947">
<p>
这是一个快速复制行内容的插件,Idea默认也是支持复制行的操作,当你选中了括号中的文字时再想进行复制编辑时这个插件就可以发挥作用了,它会复制行的内容,并将光标置于被复制行时选中的字符上,这样就可以接着进行复制后的修改操作了.
</p>
</div>
</div>
<div id="outline-container-orgd7d2927" class="outline-3">
<h3 id="orgd7d2927">
<a id="ID-6476EC26-645B-4080-97B1-4F102671F10C"></a>项目地址</h3>
<div class="outline-text-3" id="text-orgd7d2927">
<p>
<a href="https://github.com/xusoo/duplicate-lines-intellij-plugin">https://github.com/xusoo/duplicate-lines-intellij-plugin</a>
</p>
</div>
</div>
</div>
<div id="outline-container-org0a89209" class="outline-2">
<h2 id="org0a89209">
<a id="ID-222E0010-CC4E-4D8B-A645-190AB5F06678"></a>FindBugs</h2>
<div class="outline-text-2" id="text-org0a89209">
</div>
<div id="outline-container-org6b5dbfc" class="outline-3">
<h3 id="org6b5dbfc">
<a id="ID-E5C1765E-A2C7-423F-A57C-A8C4DDDEB5BA"></a>插件说明</h3>
<div class="outline-text-3" id="text-org6b5dbfc">
<p>
静态代码bug查找工具,帮程序员在编写时发现一些错误的代码问题,支持200多个分析规则.
</p>
</div>
</div>
<div id="outline-container-org3c05d4e" class="outline-3">
<h3 id="org3c05d4e">
<a id="ID-F9E78623-439D-4951-B113-AA49CB5E4DAF"></a>项目地址</h3>
<div class="outline-text-3" id="text-org3c05d4e">
<p>
<a href="http://andrepdo.github.io/findbugs-idea/">http://andrepdo.github.io/findbugs-idea/</a>
</p>
</div>
</div>
</div>
<div id="outline-container-orgd123c17" class="outline-2">
<h2 id="orgd123c17">
<a id="ID-71C062FA-7106-4556-AD1B-7A5E2727F556"></a>JSON Viewer</h2>
<div class="outline-text-2" id="text-orgd123c17">
</div>
<div id="outline-container-orge118592" class="outline-3">
<h3 id="orge118592">
<a id="ID-705D4294-9625-484A-8973-385A9059C3C1"></a>插件说明</h3>
<div class="outline-text-3" id="text-orge118592">
<p>
在Idea中进行json的格式化与查看工具.
</p>
</div>
</div>
<div id="outline-container-org2c838c9" class="outline-3">
<h3 id="org2c838c9">
<a id="ID-56A64E85-92BA-4D7A-831A-61FF7A609B91"></a>项目地址</h3>
<div class="outline-text-3" id="text-org2c838c9">
<p>
<a href="https://github.com/potterhsu/JsonViewer">https://github.com/potterhsu/JsonViewer</a>
</p>
</div>
</div>
</div>
<div id="outline-container-orgf06e1f5" class="outline-2">
<h2 id="orgf06e1f5">
<a id="ID-4862DD4F-1F8A-494E-B4EB-464097979D07"></a>Json2Java4Idea</h2>
<div class="outline-text-2" id="text-orgf06e1f5">
</div>
<div id="outline-container-orgeb09530" class="outline-3">
<h3 id="orgeb09530">
<a id="ID-39E40656-B768-40F4-B012-A9E54030DA42"></a>插件说明</h3>
<div class="outline-text-3" id="text-orgeb09530">
<p>
根据Json数据来生成Java类的工具,支持Jackson,Json,Moshi.
</p>
</div>
</div>
<div id="outline-container-org6e44a8d" class="outline-3">
<h3 id="org6e44a8d">
<a id="ID-E62B7480-B68F-49C2-8597-CBA460BA6D6B"></a>项目地址</h3>
<div class="outline-text-3" id="text-org6e44a8d">
<p>
<a href="https://github.com/t28hub/json2java4idea">https://github.com/t28hub/json2java4idea</a>
</p>
</div>
</div>
</div>
<div id="outline-container-org7b2313e" class="outline-2">
<h2 id="org7b2313e">
<a id="ID-93A20935-D6FD-4B80-A530-AB6F64241252"></a>LivePlugin</h2>
<div class="outline-text-2" id="text-org7b2313e">
</div>
<div id="outline-container-org1e6599f" class="outline-3">
<h3 id="org1e6599f">
<a id="ID-06CAFD2F-F281-45E5-952F-DB4F013F5882"></a>插件说明</h3>
<div class="outline-text-3" id="text-org1e6599f">
<p>
在不重启Idea情况下来编写Idea插件,可以编写一些小的功能插件.
</p>
</div>
</div>
<div id="outline-container-org92cdeea" class="outline-3">
<h3 id="org92cdeea">
<a id="ID-EFC0B80A-9CA6-42CB-89FA-8C225C73D47A"></a>项目地址</h3>
<div class="outline-text-3" id="text-org92cdeea">
<p>
<a href="https://github.com/dkandalov/live-plugin">https://github.com/dkandalov/live-plugin</a>
</p>
</div>
</div>
</div>
<div id="outline-container-org6f592f1" class="outline-2">
<h2 id="org6f592f1">
<a id="ID-9BC31DA0-8713-4A02-9CD0-1C76D3925086"></a>Lombok</h2>
<div class="outline-text-2" id="text-org6f592f1">
</div>
<div id="outline-container-org3c04a91" class="outline-3">
<h3 id="org3c04a91">
<a id="ID-44234C4B-1DED-429C-97FD-CFADBE345AA7"></a>插件说明</h3>
<div class="outline-text-3" id="text-org3c04a91">
<p>
<a href="https://projectlombok.org/">Lombox</a>的Idea插件,使用注释的方式来快速处理getter和setter,当然功能不止这些.
</p>
</div>
</div>
<div id="outline-container-orgb67cec9" class="outline-3">
<h3 id="orgb67cec9">
<a id="ID-F8250121-75E2-4026-8C70-F86ADC7B532F"></a>项目地址</h3>
<div class="outline-text-3" id="text-orgb67cec9">
<p>
<a href="https://github.com/mplushnikov/lombok-intellij-plugin">https://github.com/mplushnikov/lombok-intellij-plugin</a>
</p>
</div>
</div>
</div>
<div id="outline-container-orgb9b8766" class="outline-2">
<h2 id="orgb9b8766">
<a id="ID-44A4CF65-6EBD-40EA-839D-11688AA86B6A"></a>Missing In Actions</h2>
<div class="outline-text-2" id="text-orgb9b8766">
<p>
<a href="https://github.com/vsch/MissingInActions">Missing In Actions</a>，增强的action，带来了Idea Action缺少的增强动作，如移动语句自动缩进、剪切历史增强中等功能。
</p>
</div>
</div>
<div id="outline-container-orgf6ebc6a" class="outline-2">
<h2 id="orgf6ebc6a">
<a id="ID-3D44E02D-75D3-4F35-A811-6A71C969558B"></a>PlantUML</h2>
<div class="outline-text-2" id="text-orgf6ebc6a">
</div>
<div id="outline-container-org9611301" class="outline-3">
<h3 id="org9611301">
<a id="ID-6632D887-D803-4263-A657-A74903FB33AD"></a>插件说明</h3>
<div class="outline-text-3" id="text-org9611301">
<p>
在Idea中进行uml图的处理.
</p>
</div>
</div>
<div id="outline-container-org3f1a343" class="outline-3">
<h3 id="org3f1a343">
<a id="ID-0BACA036-041F-4283-98D2-D8D0958A91F0"></a>项目地址</h3>
<div class="outline-text-3" id="text-org3f1a343">
<p>
<a href="https://github.com/esteinberg/plantuml4idea">https://github.com/esteinberg/plantuml4idea</a>
</p>
</div>
</div>
</div>
<div id="outline-container-orgd0a7ae2" class="outline-2">
<h2 id="orgd0a7ae2">
<a id="ID-770E6BFF-E664-4171-9687-59F3D64652D2"></a>POJO to JSON</h2>
<div class="outline-text-2" id="text-orgd0a7ae2">
</div>
<div id="outline-container-org1a825fb" class="outline-3">
<h3 id="org1a825fb">
<a id="ID-9B1B84F1-BE93-44A7-8129-39B667B7B737"></a>插件说明</h3>
<div class="outline-text-3" id="text-org1a825fb">
<p>
Java类型转成JSON,方便用postman或者curl的时候构造JSON body.
</p>
</div>
</div>
<div id="outline-container-orgaaf0028" class="outline-3">
<h3 id="orgaaf0028">
<a id="ID-1DDC8D32-2723-45E2-9517-B23EA1B86FAD"></a>项目地址</h3>
<div class="outline-text-3" id="text-orgaaf0028">
<p>
<a href="https://plugins.jetbrains.com/plugin/9686-pojo-to-json">https://plugins.jetbrains.com/plugin/9686-pojo-to-json</a>
</p>
</div>
</div>
</div>
<div id="outline-container-org1e210ce" class="outline-2">
<h2 id="org1e210ce">
<a id="ID-C32E200E-6351-4A17-A1C6-B542E6D50FC0"></a>Save Actions</h2>
<div class="outline-text-2" id="text-org1e210ce">
</div>
<div id="outline-container-org090194e" class="outline-3">
<h3 id="org090194e">
<a id="ID-39B4C512-ABC5-47B0-9BBE-25DBEB377F45"></a>插件说明</h3>
<div class="outline-text-3" id="text-org090194e">
<p>
Idea的保存动作的执行插件,支持在保存后执行一些命令,比如重新导入包,格式化代码,重新整理代码等.
</p>
</div>
</div>
<div id="outline-container-orge54576a" class="outline-3">
<h3 id="orge54576a">
<a id="ID-BBDCBF13-7A09-4010-8A61-BD0A9D016163"></a>项目地址</h3>
<div class="outline-text-3" id="text-orge54576a">
<p>
<a href="https://github.com/dubreuia/intellij-plugin-save-actions">https://github.com/dubreuia/intellij-plugin-save-actions</a>
</p>
</div>
</div>
</div>
<div id="outline-container-org5844b79" class="outline-2">
<h2 id="org5844b79">
<a id="ID-53786D1D-D25F-4C49-8DC0-BC788CCF258C"></a>Spring Assistant</h2>
<div class="outline-text-2" id="text-org5844b79">
</div>
<div id="outline-container-orge4f34b8" class="outline-3">
<h3 id="orge4f34b8">
<a id="ID-8E4565A9-0C70-4D2E-94DF-681BA976BBE5"></a>插件说明</h3>
<div class="outline-text-3" id="text-orge4f34b8">
<p>
Springboot配置文件编写助手,在编写些插件会给出一些提示,帮助开发者可以更快速的进行配置.
</p>
</div>
</div>
